import pypdf
from tqdm import tqdm
import numpy as np
from FlagEmbedding import BGEM3FlagModel
from transformers import AutoTokenizer, AutoModelForCausalLM


class sugar_rag:
    def __init__(self,pdf_file_path,texts,batch_size,model=None,tokenizer=None):
        self.contents = []
        if model is None:
            model = BGEM3FlagModel('BAAI/bge-m3')
        if tokenizer is None:
            tokenizer = AutoTokenizer.from_pretrained("airesearch/LLaMa3-8b-WangchanX-sft-Full")
        self.model = model
        self.embeddings_k = []
        
        reader = pypdf.PdfReader(pdf_file_path)
        for i in tqdm(range(len(reader.pages))):
            content = reader.pages[i].extract_text()
            
            for j in tokenizer.encode(content, max_length=512, padding=False,truncation=True, return_overflowing_tokens=True):
                if len(j)<10:
                    continue
                passage = tokenizer.decode(j[1:])
                self.contents.append(passage)
        
        for i in tqdm(texts):
            for j in tokenizer.encode(i, max_length=512, padding=False,truncation=True, return_overflowing_tokens=True):
        
                if len(j)<10:
                    continue
                passage = tokenizer.decode(j[1:])
                #print(passage)
                self.contents.append(passage)
            
        def process_batch(batch):
            embeddings = self.model.encode(batch)['dense_vecs']
            return embeddings
        
        for i in tqdm(range(0, len(self.contents), batch_size)):

            self.embeddings_k.append(process_batch(self.contents[i:i+batch_size]))

        self.embeddings_k = np.vstack(self.embeddings_k)
    
    def print_con(self):
        for i,con in enumerate(self.contents):
            print(f"{i} : {con}")
        
        
    def retive(self,question,rank):
        embeddings_q = self.model.encode(question)['dense_vecs']
        similarity = (embeddings_q @ self.embeddings_k.T)
        ranked_indices = np.argsort(similarity)[::-1]
        
        answer = []
        for j in ranked_indices[:rank]:
            answer.append(self.contents[j])
        
        return answer
    
    def __call__(self,question,rank):
        return self.retive(question,rank)


mith_phon_text = [
"""
สวัสดีค่ะมิตรชาวไร่ ช่วงเวลานี้ซึ่งอยู่ในช่วงปลายฝนต้นหนาว พี่น้องเกษตรกรต้องระวังการระบาดของโรคฉี่หนู หรือ โรคเลปโตสไปโรสิส (leptospirosis) เป็นพิเศษ เนื่องจากอาชีพของเรา เป็นอาชีพที่เสี่ยงต่อการเกิดโรค เพราะเราต้องเก็บเกี่ยวผลผลิตทางการเกษตร หรือต้องเดินเท้าเปล่าย่ำน้ำแฉะ ๆ หรือแช่เท้าในน้ำเป็นเวลานาน ซึ่งอาจเสี่ยงติดเชื้อโรคฉี่หนูมากกว่าอาชีพอื่น ๆ

โรคฉี่หนู หรือโรคเลปโตสไปโรสิส ติดต่อจากสัตว์มาสู่คน ซึ่งเชื้อจะออกมากับฉี่ของสัตว์ เช่น หนู วัว ควาย แพะ แกะ และสุนัข แล้วปนเปื้อนในแม่น้ำ ลำคลอง พื้นที่มีน้ำขังหรือพื้นที่ชื้นแฉะ ดังนั้น ชาวไร่ควรหลีกเลี่ยงอย่าลุยน้ำหรือแช่น้ำนาน ๆ ไม่เช่นนั้นจะเสี่ยงติดโรคได้ค่ะ

สำหรับอาการของโรคนั้น จะพบหลังได้รับเชื้อ 2-10 วัน โดยจะเริ่มมีไข้สูง ปวดศีรษะ ปวดเมื่อยกล้ามเนื้อ โดยเฉพาะน่องและโคนขา ต่อมาอาจมีเยื่อบุตาแดง เจ็บคอ เบื่ออาหาร ท้องเดิน หากมีอาการเหล่านี้หลังจากไปแช่น้ำย่ำโคลนมา 2-26 วัน ควรนึกถึงโรคนี้ และไปพบแพทย์ทันที เพราะถ้าไม่รีบรักษา บางรายอาจมีจุดเลือดออกตามผิวหนัง ไอมีเลือดปน หรือตัวเหลือง ปัสสาวะน้อย ซึม สับสน เนื่องจากเยื่อหุ้มสมองอักเสบ อาจมีกล้ามเนื้อหัวใจอักเสบและเสียชีวิตได้

7 วิธีป้องกันโรคฉี่หนู โรคอันตรายที่มากับปลายฝนต้นหนาว
ควรสวมชุดป้องกัน เช่น รองเท้าบู๊ต ถุงมือ ถุงเท้า หากต้องลุยน้ำหรือแช่น้ำขัง
หลีกเลี่ยงการสัมผัสกับสัตว์ที่เป็นพาหะ ของโรคดังกล่าว
หลีกเลียงการว่ายน้ำที่อาจจะมีเชื้อโรคปนเปื้อนอยู่
หลีกเลี่ยงไม่ไปสัมผัสปัสสาวะโค กระบือ หนู สุกร และไม่ใช้แหล่งน้ำที่สงสัยว่าอาจปนเปื้อนเชื้อ
หลีกเลี่ยงอาหารที่ปล่อยค้างคืน โดยไม่มีภาชนะปกปิด เป็นต้น
หลีกเลี่ยงการทำงานในน้ำหรือต้องลุยน้ำ ลุยโคลนเป็นเวลานาน ๆ
รีบอาบน้ำ ทำความสะอาดร่างกายโดยเร็วหากแช่ หรือ ย่ำลงไปในแหล่งน้ำที่สงสัยว่าอาจปนเปื้อนเชื้อโรค
หากมีอาการเจ็บป่วยที่ผิดปกติ หรือสงสัยว่าติดเชื้อ ให้รีบไปพบแพทย์ทันทีนะคะ ด้วยความปรารถนาดีจาก มิตรผลโมเดิร์นฟาร์ม
""",
"""
น้ำ อีกหนึ่งปัจจัยสำคัญที่จำเป็นต่อการเจริญเติบโตของพืชทุกชนิด ไม่เพียงแต่อ้อยเท่านั้นที่ต้องการน้ำเพื่อช่วยให้ทุกช่วงการเจริญเติบโตสมวัยได้ผลผลิตตามที่เกษตรกรต้องการ

โดยปกติแล้วอ้อยต้องการน้ำประมาณ 1,200-1,600 มิลลิเมตรต่อปี ซึ่งขึ้นอยู่กับการกระจายตัวของฝนในแต่ละปีด้วย ทั้งนี้สภาพภูมิอากาศในปัจจุบันเปลี่ยนแปลงไปจากเดิม ทำให้ปริมาณน้ำฝนไม่เพียงพอและการกระจายตัวของฝนจึงไม่เหมาะสมทำให้อ้อยกระทบแล้งแทบทุกปี จึงเป็นสาเหตุหนึ่งที่ทำให้ ผลผลิตของอ้อยลดลง ดังนั้นเกษตรกรต้องวางแผนจัดการน้ำให้อ้อยได้รับน้ำอย่างเต็มที่ตามความต้องการในแต่ละช่วง ซึ่งอ้อยต้องการน้ำในแต่ละช่วงแตกต่างกันออกไปดังนี้

ระยะที่ 1 หรือ ระยะตั้งตัว ซึ่งเป็นระยะอ้อยเริ่มงอก อายุอ้อย 2-3 สัปดาห์ กินเวลาประมาณ 30 วันระยะนี้เป็นช่วงที่อ้อยเริ่มงอกจนมีใบ และเป็นต้นอ่อน ความต้องการน้ำจะยังไม่มากนัก เพราะรากอ้อยยังสั้นและการคายน้ำยังมีน้อย ความต้องการน้ำ ระยะนี้จะอยู่ที่ 4 มิลลิเมตรต่อวัน รวมแล้วต้องใช้น้ำ 120 มิลลิเมตร

ระยะที่ 2 หรือ ระยะเติบโตทางลำต้น ซึ่งเป็นระยะที่อ้อยแตกกอ อายุอ้อย 3-4 เดือน กินเวลา 140 วัน เปรียบเทียบกับมนุษย์คือช่วงวัยเด็กจนถึงวัยรุ่น ซึ่งเป็นช่วงที่สำคัญต่อพัฒนาการทางด้านร่างกาย อ้อยในช่วงนี้กำลังแตกกอ และสร้างปล้อง รากอ้อยเริ่มแผ่กระจายทั้งแนวราบและแนวลึก จึงเป็นช่วงที่อ้อยต้องการน้ำมากและบ่อยครั้ง หากได้รับน้ำอย่างเพียงพอ จำนวนลำต่อกอจะมีมาก ปล้องจะยาว และผลผลิตสูง ระยะนี้อ้อยมีความต้องการน้ำ 4.5 มิลลิเมตรต่อวัน รวมแล้วต้องใช้น้ำ 630 มิลลิเมตร

ระยะที่ 3 หรือ ระยะสร้างน้ำตาล อายุ 7-8 เดือน กินเวลา 125 วัน ระยะนี้เป็นช่วงที่ให้น้ำเฉพาะในอ้อยที่เริ่มแสดงอาการขาดน้ำ ไม่จำเป็นต้องให้น้ำบ่อย เพราะพื้นที่ใบอ้อยที่ใช้ประโยชน์จะน้อยลง และอ้อยคายน้ำน้อยลง รวมถึงตอบสนองต่อแสงแดดน้อยลง ระยะนี้ความต้องการน้ำจะอยู่ที่ 5 มิลลิเมตรต่อวัน รวมความต้องการน้ำ 625 มิลลิเมตร

ระยะที่ 4 หรือ ระยะสุกแก่ กินเวลาประมาณ 35 วัน เป็นช่วงที่อ้อยเติบโตน้อยลง และกำลังสะสมน้ำตาล ความต้องการน้ำ 4 มิลลิเมตรต่อวัน รวมความต้องการน้ำ 140 มิลลิเมตร

เมื่อดูปริมาณน้ำที่อ้อยต้องการตลอดฤดูกาลเมื่อเทียบกับปริมาณน้ำฝนที่ตกเพียง 100-120 วันในช่วงเดือนพฤษภาคม-กันยายนของแต่ละปีด้วยปริมาณเฉลี่ย 1,000-1,200 มิลลิเมตรต่อปี สรุปได้ว่า ปริมาณน้ำฝนอย่างเดียวไม่เพียงพอต่อความต้องการของอ้อย
""",
"""
สวัสดีค่ะพี่น้องมิตรชาวไร่ แม้จะเข้าสู่ช่วงฤดูฝนอย่างเป็นทางการของประเทศไทยแล้ว ยังพบว่าหลายพื้นที่ฝนทิ้งช่วง พืชเกษตรเสียหายจากภาวะฝนทิ้งช่วงจำนวนมาก ซึ่งเมื่อไม่นานมานี้ องค์การอุตุนิยมวิทยาโลก หรือ ดับเบิลยูเอ็มโอ (WMO) องค์กรหนึ่งของสหประชาชาติ เปิดเผยว่า WMO ได้ประมาณการว่า มีโอกาส ร้อยละ 60 ที่จะเกิดปรากฏการณ์ ‘เอลนีโญ’ ภายในสิ้นเดือนกรกฎาคมปีนี้ และมีโอกาสร้อยละ 80 ที่จะเกิดเอลนีโญภายในสิ้นเดือนกันยายน

เอลนีโญ คืออะไร เอลนีโญ เป็นรูปแบบสภาพภูมิอากาศที่มักจะเกี่ยวข้องกับการที่อุณหภูมิอากาศปรับตัวสูงขึ้นทั่วโลก รวมถึงความแห้งแล้งที่จะเกิดขึ้นในพื้นที่บางส่วนของโลก และเกิดฝนตกหนักในพื้นที่ส่วนอื่นของโลก โดยเกิดขึ้นครั้งล่าสุดเมื่อปี ค.ศ. 2018-2019 และนับตั้งแต่ปี ค.ศ. 2020 เป็นต้นมา หรือ 3 ปี โลกเผชิญกับสภาวะอากาศที่เป็นผลมาจากปรากฏการณ์ ‘ลานีญา’ เป็นระยะเวลายาวนาน และสิ้นสุดไปเมื่อต้นปีที่ผ่านมา ทำให้ภูมิอากาศมีสภาพเป็นกลาง

อย่างไรก็ตาม ในช่วง 8 ปีที่ผ่านมา อุณหภูมิโลกสูงขึ้นเป็นประวัติการณ์ และการเกิดเอลนีโญ จะทำให้อุณหภูมิโลกปรับตัวเพิ่มขึ้นอีกและอาจจะสูงทำลายสถิติก็เป็นไปได้

นายเพทเทรี ทาลัส เลขาธิการ WMO ระบุว่า โลกควรเตรียมพร้อมสำหรับการพัฒนาของปรากฏการณ์เอลนีโญ ซึ่งมักจะเกี่ยวข้องกับความร้อน ความแห้งแล้ง หรือปริมาณน้ำฝนที่เพิ่มขึ้นในส่วนต่างๆ ของโลก อาจนำมาซึ่งการทุเลาจากภัยแล้งในฮอร์น ออฟ แอฟริกา” (Horn of Africa) และผลกระทบอื่นๆ ที่เกี่ยวข้องกับลานีญา แต่ก็อาจกระตุ้นให้เกิดสภาพอากาศที่รุนแรงมากขึ้น ซึ่งสิ่งนี้เน้นย้ำถึงความจำเป็น ในการริเริ่มคำเตือนล่วงหน้าเพื่อให้ผู้คนปลอดภัย

สำหรับประเทศไทยเอง กรมอุตุนิยมวิทยา คาดหมายลักษณะอากาศช่วงฤดูฝนของประเทศไทย ระบุว่า ฤดูฝนของประเทศไทยปีนี้มาช้ากว่าปกติเล็กน้อย และจะสิ้นสุดประมาณกลางเดือนตุลาคม 2566 โดยปริมาณฝนรวมของทั้งประเทศในช่วงฤดูฝนปีนี้ จะน้อยกว่าค่าเฉลี่ยปกติเล็กน้อย ประมาณร้อยละ 5 และน้อยกว่าปีที่แล้ว (ปีที่แล้วในช่วงฤดูฝนปริมาณฝนรวมมากกว่าค่าเฉลี่ยปกติร้อยละ 14 และปริมาณฝนรวมทั้งปีมากกว่าค่าเฉลี่ยปกติ ร้อยละ 24)

โดยทั้งในช่วงครึ่งแรกของฤดูฝน ตั้งแต่เริ่มต้นเดือนกรกฎาคม และช่วงครึ่งหลังฤดูฝน เดือนสิงหาคมถึงกลางเดือนตุลาคม ปริมาณฝนรวมส่วนใหญ่จะน้อยกว่าค่าเฉลี่ยปกติประมาณร้อยละ 5

แต่จะมีฝนทิ้งช่วง ในช่วงเดือนมิถุนายน – กลางเดือนกรกฎาคม ส่งผลให้ปริมาณและการกระจายของฝนมีน้อย ทำให้พื้นที่แล้งซ้ำซาก บริเวณนอกเขตชลประทานอาจจะเกิดการขาดแคลนน้ำใช้สำหรับทำการเกษตรได้ในหลายพื้นที่

ในช่วงครึ่งหลังของฤดูฝนนั้น จะเป็นช่วงที่มีฝนตกชุกหนาแน่นที่สุด และมีโอกาสที่จะเกิดพายุหมุนเขตร้อนเคลื่อนผ่านบริเวณประเทศไทย ซึ่งจะทำให้มีฝนตกหนักถึงหนักมากในหลายพื้นที่ ทำให้เกิดน้ำท่วมฉับพลัน น้ำป่าไหลหลาก และน้ำล้นตลิ่งได้

โดยในบางช่วงนั้น จะมีฝนตกหนักถึงหนักมากติดต่อกันหลายวัน โดยเฉพาะในช่วงเดือนสิงหาคม – กันยายน ส่วนพายุหมุนเขตร้อนที่จะเคลื่อนผ่านประเทศไทยนั้น จะมีลักษณะเป็นพายุลมแรง มีฝนตกเป็นบริเวณกว้าง มีฝนตกหนักถึงหนักมากหลายพื้นที่

ด้านการรับมือ เอลนีโญ ในประเทศไทย นายประพิศ จันทร์มา อธิบดี กรมชลประทาน เปิดเผยว่า กรมอุตุนิยมวิทยา ได้คาดการณ์ว่า ปรากฏการณ์เอลนีโญ ในช่วงเดือนมิถุนายน-กันยายนนี้ จะส่งผลให้ทั้งประเทศไทยเกิดฝนตกน้อยกว่าปกติ กรมชลประทาน จึงได้เตรียมแผนรับมือตั้งแต่ช่วงฤดูฝนปี 2566 นี้เป็นต้นไป เพื่อลดผลกระทบต่อสถานการณ์ภัยแล้งที่อาจเกิดขึ้นได้ในอนาคต

โดยได้กำชับให้โครงการชลประทานทั่วประเทศ เฝ้าระวัง ติดตาม และประเมินสถานการณ์อย่างรอบคอบ เพื่อนำข้อมูลมาวิเคราะห์และปรับแผนบริหารจัดการน้ำให้เหมาะสมสอดคล้องกับสถานการณ์ในแต่ละพื้นที่ ที่สำคัญให้เร่งเก็บกักน้ำให้ได้มากที่สุด ส่วนพื้นที่ลุ่มต่ำที่กรมชลประทานได้ปรับปฏิทินเพาะปลูกให้เกษตรกรได้เพาะปลูกและเก็บเกี่ยวผลผลิตก่อนฤดูน้ำหลากจะมาถึง

ปัจจุบันกรมชลประทานได้ส่งน้ำเข้าระบบชลประทาน เพื่อให้เกษตรกรได้เพาะปลูกแล้ว และจะเร่งเก็บเกี่ยวผลผลิตให้ทันก่อนน้ำหลากในช่วงกลางเดือนกันยายน เพื่อลดความเสี่ยงที่จะเกิดความเสียหายจากอุทกภัย

นอกจากนี้ ได้กำชับให้โครงการชลประทานทุกแห่งปฏิบัติตามมาตรการบริหารจัดการน้ำฤดูฝนปี 2566 ที่กรมชลประทานกำหนด ควบคู่ไปกับการปฏิบัติตามมาตรการรองรับฤดูฝนปี 2566 ที่กองอำนวยการน้ำแห่งชาติกำหนด อย่างเคร่งครัด เพื่อลดผลกระทบที่จะเกิดขึ้นกับประชาชนให้มากที่สุด

อย่างไรก็ดี ขอให้มิตรชาวไร่เตรียมรับมือกับสถานการณ์ต่าง ๆ ที่คาดการณ์จะเกิดขึ้น ทั้งสภาวะฝนทิ้งช่วงก็ดี หรือสภาวะเอลนีโญก็ดี เพราะหากเรามีแผนสำรองสำหรับสภาพอากาศต่าง ๆ ที่เกิดขึ้น อ้อยของเราจะได้รับผลกระทบน้อยที่สุด หรืออาจไม่กระทบเลย หากมีการวางแผนและเตรียมการที่ดีนั่นเองค่ะ 
"""
]